app/controllers/encrypted_strings_controller.rb

DELETE FROM "encrypted_strings" WHERE "encrypted_strings"."id" = $1  [["id", 980190964]]
---
  def destroy
    @encrypted_string.destroy!

SELECT "encrypted_strings".* FROM "encrypted_strings" WHERE "encrypted_strings"."token" = $1 LIMIT $2  [["token", "0c2c064176110de2bb8f21b5e1e1356f"], ["LIMIT", 1]]
---
  def load_encrypted_string
    @encrypted_string = EncryptedString.find_by(token: params[:token].to_s)