app/controllers/encrypted_strings_controller.rb

INSERT INTO "encrypted_strings" ("encrypted_value", "encrypted_value_iv", "encrypted_value_salt", "data_encrypting_key_id", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @encrypted_string = EncryptedString.new(value: encrypted_string_params[:value])
    if @encrypted_string.save

SELECT "encrypted_strings".* FROM "encrypted_strings" WHERE "encrypted_strings"."token" = $1 LIMIT $2  [["token", " a56a65fd3d3a5a7cc62826057777aa80"], ["LIMIT", 1]]
---
  def load_encrypted_string
    @encrypted_string = EncryptedString.find_by(token: params[:token].to_s)